#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
azurerm_resource_group.this: Refreshing state... [id=/subscriptions/2d99ea97-e07c-4123-a34c-25787531e5a9/resourceGroups/pappu]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01YTQwYjI3NC02NmM2LTQ4MTgtYTdlMS02Y2E3ODY3MDEyNTg7b2JqZWN0SWQ9ODY0YzYxYzAtZTAwMi00MzIwLTlhZWEtYWEyMWZkMjVhOTAzO3N1YnNjcmlwdGlvbklkPTJkOTllYTk3LWUwN2MtNDEyMy1hMzRjLTI1Nzg3NTMxZTVhOTt0ZW5hbnRJZD1hYzJmZmQ3Yy1kYTg1LTQ3NjUtYWY4NC0xZjE0MTcxNzNiOTQ=]
azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/2d99ea97-e07c-4123-a34c-25787531e5a9/resourceGroups/pappu/providers/Microsoft.Network/virtualNetworks/pappu-dev-vnet]
azurerm_subnet.app: Refreshing state... [id=/subscriptions/2d99ea97-e07c-4123-a34c-25787531e5a9/resourceGroups/pappu/providers/Microsoft.Network/virtualNetworks/pappu-dev-vnet/subnets/pappu-dev-subnet-app]
azurerm_storage_account.pdf: Refreshing state... [id=/subscriptions/2d99ea97-e07c-4123-a34c-25787531e5a9/resourceGroups/pappu/providers/Microsoft.Storage/storageAccounts/pappudevpdfsa]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = (known after apply)
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "pappu-dev-kv"
      + public_network_access_enabled = false
      + purge_protection_enabled      = true
      + rbac_authorization_enabled    = true
      + resource_group_name           = "pappu"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "owner"       = "data-engineering"
          + "project"     = "pappu"
        }
      + tenant_id                     = "ac2ffd7c-da85-4765-af84-1f1417173b94"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = "AzureServices"
          + default_action             = "Deny"
          + virtual_network_subnet_ids = [
              + "/subscriptions/2d99ea97-e07c-4123-a34c-25787531e5a9/resourceGroups/pappu/providers/Microsoft.Network/virtualNetworks/pappu-dev-vnet/subnets/pappu-dev-subnet-app",
            ]
        }
    }

  # azurerm_storage_account.pdf will be updated in-place
  ~ resource "azurerm_storage_account" "pdf" {
        id                                = "/subscriptions/2d99ea97-e07c-4123-a34c-25787531e5a9/resourceGroups/pappu/providers/Microsoft.Storage/storageAccounts/pappudevpdfsa"
        name                              = "pappudevpdfsa"
        tags                              = {
            "environment" = "dev"
            "managed_by"  = "terraform"
            "owner"       = "data-engineering"
            "project"     = "pappu"
        }
        # (40 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "135.232.208.114",
              + "106.222.203.170",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_container.pdf_uploads will be created
  + resource "azurerm_storage_container" "pdf_uploads" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "pdf-uploads"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/2d99ea97-e07c-4123-a34c-25787531e5a9/resourceGroups/pappu/providers/Microsoft.Storage/storageAccounts/pappudevpdfsa"
    }

  # azurerm_subnet.app will be updated in-place
  ~ resource "azurerm_subnet" "app" {
        id                                            = "/subscriptions/2d99ea97-e07c-4123-a34c-25787531e5a9/resourceGroups/pappu/providers/Microsoft.Network/virtualNetworks/pappu-dev-vnet/subnets/pappu-dev-subnet-app"
        name                                          = "pappu-dev-subnet-app"
      ~ service_endpoints                             = [
          + "Microsoft.KeyVault",
            # (1 unchanged element hidden)
        ]
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @sreedath19, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Plan`*